src/logs/smct/test-bet-place-20250730-175024.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/smct/test-bet-place.ts
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 40s max duration (incl. graceful stop):
              * default: 500 looping VUs for 10s (gracefulStop: 30s)


running (00.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 500 VUs  00.5s/10s

running (01.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 500 VUs  01.5s/10s

running (02.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 500 VUs  02.5s/10s

running (03.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 500 VUs  03.5s/10s

running (04.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 500 VUs  04.5s/10s

running (05.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  55% ] 500 VUs  05.5s/10s

running (06.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  65% ] 500 VUs  06.5s/10s

running (07.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  75% ] 500 VUs  07.5s/10s

running (08.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  85% ] 500 VUs  08.5s/10s

running (09.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  95% ] 500 VUs  09.5s/10s

running (10.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (11.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (12.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (13.5s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (14.5s), 497/500 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (15.5s), 496/500 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (16.5s), 496/500 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (17.5s), 487/500 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (18.5s), 480/500 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (19.5s), 471/500 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (20.5s), 471/500 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (21.5s), 463/500 VUs, 37 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (22.5s), 460/500 VUs, 40 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (23.5s), 458/500 VUs, 42 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (24.5s), 456/500 VUs, 44 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (25.5s), 448/500 VUs, 52 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (26.5s), 443/500 VUs, 57 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (27.5s), 439/500 VUs, 61 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (28.5s), 439/500 VUs, 61 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (29.5s), 438/500 VUs, 62 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (30.5s), 438/500 VUs, 62 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (31.5s), 429/500 VUs, 71 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (32.5s), 429/500 VUs, 71 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (33.5s), 428/500 VUs, 72 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (34.5s), 428/500 VUs, 72 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (35.5s), 428/500 VUs, 72 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (36.5s), 428/500 VUs, 72 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (37.5s), 427/500 VUs, 73 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (38.5s), 417/500 VUs, 83 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (39.5s), 417/500 VUs, 83 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......................: 83     2.072142/s
    checks_succeeded...................: 97.59% 81 out of 83
    checks_failed......................: 2.40%  2 out of 83

    ✗ status is 201
      ↳  97% — ✓ 81 / ✗ 2

    HTTP
    http_req_duration.......................................................: avg=23.82s min=11.96s med=22.58s max=37.46s p(90)=37.23s p(95)=37.43s
      { expected_response:true }............................................: avg=23.82s min=14.12s med=22.58s max=37.46s p(90)=37.31s p(95)=37.43s
    http_req_failed.........................................................: 2.40%  2 out of 83
    http_reqs...............................................................: 83     2.072142/s

    EXECUTION
    iteration_duration......................................................: avg=24.34s min=13.59s med=23.02s max=38.22s p(90)=38.02s p(95)=38.2s 
    iterations..............................................................: 83     2.072142/s
    vus.....................................................................: 417    min=417     max=500
    vus_max.................................................................: 500    min=500     max=500

    NETWORK
    data_received...........................................................: 1.6 MB 41 kB/s
    data_sent...............................................................: 450 kB 11 kB/s



running (40.1s), 000/500 VUs, 83 complete and 417 interrupted iterations
default ✓ [ 100% ] 500 VUs  10s